Revit 2024 API
MultistoryStairs.GetStairsPlacementLevels Method
 Gets all the levels the given stairs group placed on.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public ISet<ElementId> GetStairsPlacementLevels(
	Stairs stairs
)
Visual Basic
Public Function GetStairsPlacementLevels ( _
	stairs As Stairs _
) As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetStairsPlacementLevels(
	Stairs^ stairs
)
Parameters
stairs
Type: Autodesk.Revit.DB.Architecture.Stairs
 A stairs element in this multistory stairs element.
Return Value
 The ids of base levels of the given stairs in this multistory stairs.
Remarks
 If a stairs element is a stairs group, it gets all the base levels of each member of the group; If a stairs element is an individual stairs, it just gets the base level of the stairs element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input stairs is not a member of this multistory stairs.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace